Repository: ivan-stock/NexLingo
Catalog: NexLingo/Localizable.xcstrings
Source language: en
Languages: hi, ko, vi, zh_hans

# API 设置
source: API Settings
hi: API सेटिंग्स
ko: API 설정
vi: Cài đặt API
zh_hans: API设置

# 使用说明
source: User Guide
hi: उपयोगकर्ता मार्गदर्शिका
ko: 사용 설명서
vi: Hướng dẫn sử dụng
zh_hans: 使用说明

# 保存并应用
source: Save & Apply
hi: सहेजें और लागू करें
ko: 저장 및 적용
vi: Lưu & Áp dụng
zh_hans: 保存并应用

# 保存成功
source: Saved
hi: सफलतापूर्वक सहेजा गया
ko: 성공적으로 저장되었습니다
vi: Đã lưu thành công
zh_hans: 保存成功

# 发生了未知错误：%@
source: An unknown error occurred: %@
hi: एक अज्ञात त्रुटि हुई: %@
ko: 알 수 없는 오류가 발생했습니다: %@
vi: Đã xảy ra lỗi không xác định: %@
zh_hans: 发生了未知错误：%@

# 口语
source: Casual
hi: अनौपचारिक
ko: 구어체
vi: Giao tiếp / Thông thường
zh_hans: 口语

# 好的
source: OK
hi: ठीक है
ko: 확인
zh_hans: 好的

# 完成
source: Done
hi: हो गया
ko: 완료
vi: Hoàn tất
zh_hans: 完成

# 开始翻译
source: Translate
hi: अनुवाद शुरू करें
ko: 번역 시작
vi: Bắt đầu dịch
zh_hans: 开始翻译

# 您的 API Key 将使用最高安全级别加密存储在您设备的 Keychain （钥匙串）中，绝不会上传至任何服务器。
source: Your API Key is encrypted and stored securely in your device's Keychain. It will never be uploaded to any server.
hi: आपकी API Key उच्चतम सुरक्षा स्तर के साथ एन्क्रिप्ट की गई है और आपके डिवाइस के कीचेन (Keychain) में सुरक्षित रूप से संग्रहीत है। इसे कभी भी किसी सर्वर पर अपलोड नहीं किया जाएगा।
ko: 귀하의 API Key는 최고 보안 수준으로 암호화되어 기기의 키체인(Keychain)에 안전하게 저장되며, 어떠한 서버로도 업로드되지 않습니다.
vi: API Key của bạn được mã hóa ở mức bảo mật cao nhất và lưu trữ trong Keychain của thiết bị. Nó sẽ không bao giờ được tải lên bất kỳ máy chủ nào.
zh_hans: 您的 API Key 将使用最高安全级别加密存储在您设备的 Keychain （钥匙串）中，绝不会上传至任何服务器。

# 您的 API Key 已经安全存储
source: API Key stored securely
hi: आपकी API Key सुरक्षित रूप से संग्रहीत कर ली गई है
ko: API Key가 안전하게 저장되었습니다
vi: API Key của bạn đã được lưu trữ an toàn
zh_hans: 您的 API Key 已经安全存储

# 我知道了
source: Got it
hi: समझ गया
ko: 알겠습니다
vi: Đã hiểu
zh_hans: 我知道了

# 提示
source: Notice
hi: सूचना
ko: 알림
vi: Thông báo
zh_hans: 提示

# 支持与法律
source: Support & Legal
hi: समर्थन और कानूनी
ko: 지원 및 법률
vi: Hỗ trợ & Pháp lý
zh_hans: 支持与法律

# 正式
source: Formal
hi: औपचारिक
ko: 격식체
vi: Trang trọng
zh_hans: 正式

# 网络错误：%@
source: Network error: %@
hi: नेटवर्क त्रुटि: %@
ko: 네트워크 오류: %@
vi: Lỗi mạng: %@
zh_hans: 网络错误：%@

# 翻译中...
source: Translating...
hi: अनुवाद कर रहा है...
ko: 번역 중...
vi: Đang dịch...
zh_hans: 翻译中...

# 翻译为：
source: Translate to:
hi: इसमें अनुवाद करें:
ko: 번역할 언어:
vi: Dịch sang:
zh_hans: 翻译为：

# 翻译结果将显示在这里...
source: Translation will appear here...
hi: अनुवाद परिणाम यहाँ दिखाई देगा...
ko: 번역 결과가 여기에 표시됩니다...
vi: Kết quả dịch sẽ xuất hiện ở đây...
zh_hans: 翻译结果将显示在这里...

# 解析翻译结果失败，请稍后再试。
source: Failed to parse translation. Please try again.
hi: अनुवाद पार्स करने में विफल। कृपया बाद में पुन: प्रयास करें।
ko: 번역 결과를 분석하는 데 실패했습니다. 나중에 다시 시도해 주세요.
vi: Không thể phân tích kết quả dịch. Vui lòng thử lại sau.
zh_hans: 解析翻译结果失败，请稍后再试。

# 设置
source: Settings
hi: सेटिंग्स
ko: 설정
vi: Cài đặt
zh_hans: 设置

# 请先在设置中填写并保存 API Key。
source: Please configure and save your API Key in Settings.
hi: कृपया पहले सेटिंग्स में अपनी API Key दर्ज करें और सहेजें।
ko: 먼저 설정에서 API Key를 입력하고 저장해 주세요.
vi: Vui lòng điền và lưu API Key trong phần Cài đặt trước.
zh_hans: 请先在设置中填写并保存 API Key。

# 请求的 URL 格式不正确。
source: Invalid URL format.
hi: अमान्य URL प्रारूप।
ko: 요청한 URL 형식이 올바르지 않습니다.
vi: Định dạng URL không hợp lệ.
zh_hans: 请求的 URL 格式不正确。

# 请求被拒绝或网络异常，请检查 API Key是否有效。
source: Request denied or network error. Please check if your API Key is valid.
hi: अनुरोध अस्वीकृत कर दिया गया या नेटवर्क त्रुटि, कृपया जांचें कि आपकी API Key मान्य है या नहीं।
ko: 요청이 거부되었거나 네트워크 오류가 발생했습니다. API Key가 유효한지 확인해 주세요.
vi: Yêu cầu bị từ chối hoặc lỗi mạng, vui lòng kiểm tra xem API Key của bạn có hợp lệ không.
zh_hans: 请求被拒绝或网络异常，请检查 API Key是否有效。

# 请输入 ChatGPT API Key （sk-...）
source: Enter ChatGPT API Key (sk-...)
hi: कृपया ChatGPT API Key दर्ज करें (sk-...)
ko: ChatGPT API Key를 입력해 주세요 (sk-...)
vi: Vui lòng nhập ChatGPT API Key (sk-...)
zh_hans: 请输入 ChatGPT API Key （sk-...）

# 选择目标语言
source: Select Target Language
hi: लक्ष्य भाषा चुनें
ko: 목표 언어 선택
vi: Chọn ngôn ngữ đích
zh_hans: 选择目标语言

# 隐私政策
source: Privacy Policy
hi: गोपनीयता नीति
ko: 개인정보 처리방침
vi: Chính sách bảo mật
zh_hans: 隐私政策
